configuration/src/InformationRegisters/CalendarNonWorkDaysPeriods/CalendarNonWorkDaysPeriods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CalendarNonWorkDaysPeriods</name>
  <resources>
    <name>StartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>EndDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Basis</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>BusinessCalendar</name>
    <type>
      <types>CatalogRef.BusinessCalendars</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PeriodNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/CalendarNonWorkDaysPeriods/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Private

Function NonWorkDaysPeriods(BusinessCalendar) Export
	
	Query = New Query;
	Query.SetParameter("BusinessCalendar", BusinessCalendar);
	Query.Text = 
		"SELECT
		|	CalendarNonWorkDaysPeriods.BusinessCalendar AS BusinessCalendar,
		|	CalendarNonWorkDaysPeriods.PeriodNumber AS PeriodNumber,
		|	CalendarNonWorkDaysPeriods.StartDate AS StartDate,
		|	CalendarNonWorkDaysPeriods.EndDate AS EndDate,
		|	CalendarNonWorkDaysPeriods.Basis AS Basis
		|FROM
		|	InformationRegister.CalendarNonWorkDaysPeriods AS CalendarNonWorkDaysPeriods
		|WHERE
		|	CalendarNonWorkDaysPeriods.BusinessCalendar = &BusinessCalendar
		|
		|ORDER BY
		|	PeriodNumber";
	Return Query.Execute().Unload();
	
EndFunction

#EndRegion

#EndIf
